#+PROPERTY: header-args :tangle .emacs :results output silent
*** The Node issue
    Node doesn't have a good history of dealing with autosave and backup files.
    If we set this to exist within the emacs config directory we can fix this.

    Also it keeps the general project directory clean.
    #+begin_src emacs-lisp
      (setq backup-directory-alist
	    `(("." . ,(expand-file-name
		       (concat user-emacs-directory "backups")))))

      (setq auto-save-file-name-transforms
		`((".*" ,(expand-file-name
			  (concat user-emacs-directory "auto-save")) t)))

    #+end_src

    #+RESULTS:
    | .* | /home/thomas/.emacs.d/auto-save | t |

    Lockfiles also suffer from the above issues so make sure they are disabled as I don't think we can rename them somewhere else.
    #+begin_src emacs-lisp
      (setq create-lockfiles nil)
    #+end_src

**** Startup
     Disable startup screens and change the initial buffer choice.
     We also set the *scratch-buffer* to org-mode
     #+begin_src emacs-lisp
       (setq inhibit-startup-screen t
	     initial-major-mode 'org-mode
	     initial-buffer-choice "~/org/global.org"
	     initial-scratch-message "\
       ,* Notes
       - This is a initial scratch buffer
       - Buffer is set to org mode
       - Run snippetts like a iPython Notebook using org-bable

       ")
     #+end_src

     #+RESULTS:
     : * Notes
     : - This is a initial scratch buffer
     : - Buffer is set to org mode
     : - Run snippetts like a iPython Notebook using org-bable
     : 

**** Doom Themes
     General User Interface
     #+begin_src emacs-lisp
       (use-package doom-themes
	 :quelpa
	 :init
	 (progn 
	   (require 'doom-themes)

	   ;; Global settings (defaults)
	   (setq doom-themes-enable-bold t    ; if nil, bold is universally disabled
		 doom-themes-enable-italic t
		 doom-vibrant-brighter-modeline nil
		 org-hide-leading-stars nil) ; if nil, italics is universally disabled
	   (load-theme 'doom-vibrant t)
	   ;; Enable flashing mode-line on errors
	   (doom-themes-visual-bell-config)
	   ;; Corrects (and improves) org-mode's native fontification.
	   (doom-themes-org-config)))
     #+end_src

     #+RESULTS:
     
     The UI Can be finnicky with setting the theme when launched in a GUI emacsclient and uses the terminal theme.
     We don't want this
     #+begin_src emacs-lisp
       (add-hook 'after-make-frame-functions (lambda (frame)
					       (when (display-graphic-p frame)
						 (enable-theme 'doom-vibrant)
						 (load-theme 'doom-vibrant))))
     #+end_src

     #+RESULTS:
     | (lambda (frame) (when (display-graphic-p frame) (enable-theme (quote doom-vibrant)) (load-theme (quote doom-vibrant)))) | x-dnd-init-frame |

